<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 4 changes.</summary>

```diff
+ tailscale_tailnet_key.tailscale_key will be created
! module.debian13.proxmox_virtual_environment_vm.vm must be replaced
! module.ubuntu22.proxmox_virtual_environment_vm.vm must be replaced
+ module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 0 to change, 2 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-16T06:47:30Z [(view log)](https://github.com/perchnet/p/actions/runs/17005505526/job/48214468533#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.debian13.proxmox_virtual_environment_vm.vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "9013" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:A5:0A:C1",
        ] -> (known after apply)
        name                    = "debian13"
      ~ network_interface_names = [] -> (known after apply)
      ~ tags                    = [
          - "debian",
          - "template",
            "terraform",
          + "template",
          + "debian",
        ]
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ discard           = "ignore" -> "on"
          - file_id           = "zssd-files:iso/debian-13-generic-amd64.img" -> null # forces replacement
          + import_from       = "zssd-files:iso/debian-13-generic-amd64.img"
          ~ path_in_datastore = "vm-9013-disk-1" -> (known after apply)
            # (11 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:A5:0A:C1" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "8022" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:0B:73:CB",
        ] -> (known after apply)
        name                    = "ubuntu22"
      ~ network_interface_names = [] -> (known after apply)
      ~ tags                    = [
          - "template",
            "terraform",
          + "template",
            "ubuntu",
        ]
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ discard           = "ignore" -> "on"
          - file_id           = "zssd-files:iso/ubuntu-22.04-server-cloudimg-amd64.img" -> null # forces replacement
          + import_from       = "zssd-files:iso/ubuntu-22.04-server-cloudimg-amd64.img"
          ~ path_in_datastore = "vm-8022-disk-0" -> (known after apply)
            # (11 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:0B:73:CB" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Terraform VM created on 2025-08-16T06:33:08Z"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "vm-debian13-minimal"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "pve1"
          + retries   = 1
          + vm_id     = (known after apply)
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 10
          + ssd               = false
        }
      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = "vm-131-disk-0"
          + replicate         = true
          + size              = 1
          + ssd               = false
            # (1 unchanged attribute hidden)
        }

      + initialization {
          + datastore_id         = "local"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = "nocloud"
          + user_data_file_id    = "snippets:snippets/a19c397a81064341.user-data.yaml"
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + memory {
          + dedicated      = 1024
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-61-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->